<!doctype html>



  


<html class="theme-next muse use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="算法,聚类," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x7B80;&amp;#x4ECB;Mean shift&amp;#x7684;&amp;#x8FD9;&amp;#x79CD;&amp;#x601D;&amp;#x60F3;&amp;#x53EF;&amp;#x4EE5;&amp;#x5E94;&amp;#x7528;&amp;#x4E8E;&amp;#x76EE;&amp;#x6807;&amp;#x8DDF;&amp;#x8E2A;&amp;#x3001;&amp;#x56FE;&amp;#x50CF;&amp;#x5E73;&amp;#x6ED1;&amp;#x3001;&amp;#x8FB9;&amp;#x7F1">
<meta property="og:type" content="article">
<meta property="og:title" content="Mean shift 聚类分析">
<meta property="og:url" content="http://yoursite.com/2016/10/09/mean-shift/index.html">
<meta property="og:site_name" content="Delta">
<meta property="og:description" content="&amp;#x7B80;&amp;#x4ECB;Mean shift&amp;#x7684;&amp;#x8FD9;&amp;#x79CD;&amp;#x601D;&amp;#x60F3;&amp;#x53EF;&amp;#x4EE5;&amp;#x5E94;&amp;#x7528;&amp;#x4E8E;&amp;#x76EE;&amp;#x6807;&amp;#x8DDF;&amp;#x8E2A;&amp;#x3001;&amp;#x56FE;&amp;#x50CF;&amp;#x5E73;&amp;#x6ED1;&amp;#x3001;&amp;#x8FB9;&amp;#x7F1">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/shift intro.jpg">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation1.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation2.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation3.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation4.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation5.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation6.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation7.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/simplify core shift.jpg">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/equation8.png">
<meta property="og:image" content="http://yoursite.com/2016/10/09/mean-shift/simplify core shift result.png">
<meta property="og:updated_time" content="2016-10-09T10:45:17.435Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Mean shift 聚类分析">
<meta name="twitter:description" content="&amp;#x7B80;&amp;#x4ECB;Mean shift&amp;#x7684;&amp;#x8FD9;&amp;#x79CD;&amp;#x601D;&amp;#x60F3;&amp;#x53EF;&amp;#x4EE5;&amp;#x5E94;&amp;#x7528;&amp;#x4E8E;&amp;#x76EE;&amp;#x6807;&amp;#x8DDF;&amp;#x8E2A;&amp;#x3001;&amp;#x56FE;&amp;#x50CF;&amp;#x5E73;&amp;#x6ED1;&amp;#x3001;&amp;#x8FB9;&amp;#x7F1">
<meta name="twitter:image" content="http://yoursite.com/2016/10/09/mean-shift/shift intro.jpg">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Muse',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/10/09/mean-shift/"/>

  <title> Mean shift 聚类分析 | Delta </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Delta</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Mean shift 聚类分析
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-09T16:29:52+08:00" content="2016-10-09">
              2016-10-09
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/点云处理/" itemprop="url" rel="index">
                    <span itemprop="name">点云处理</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x7B80;&#x4ECB;"><a href="#&#x7B80;&#x4ECB;" class="headerlink" title="&#x7B80;&#x4ECB;"></a>&#x7B80;&#x4ECB;</h2><p>Mean shift&#x7684;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x76EE;&#x6807;&#x8DDF;&#x8E2A;&#x3001;&#x56FE;&#x50CF;&#x5E73;&#x6ED1;&#x3001;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x3001;&#x805A;&#x7C7B;&#x7B49;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x9002;&#x5E94;&#x6027;&#x5F88;&#x597D;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x6162;&#x3002;</p>
<a id="more"></a>
<p>Mean Shift &#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6700;&#x65E9;&#x662F;&#x7531;Fukunaga&#x7B49;&#x4EBA;&#x4E8E;1975&#x5E74;&#x5728;&#x4E00;&#x7BC7;&#x5173;&#x4E8E;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x68AF;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x4F30;&#x8BA1;&#xFF08;The Estimation of the Gradient of a Density Function, with Applications in Pattern Recognition&#xFF09;&#x4E2D;&#x63D0;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x5176;&#x6700;&#x521D;&#x542B;&#x4E49;&#x6B63;&#x5982;&#x5176;&#x540D;&#xFF0C;&#x5C31;&#x662F;&#x504F;&#x79FB;&#x7684;&#x5747;&#x503C;&#x5411;&#x91CF;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;Mean Shift&#x662F;&#x4E00;&#x4E2A;&#x540D;&#x8BCD;&#xFF0C;&#x5B83;&#x6307;&#x4EE3;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x4F46;&#x968F;&#x7740;Mean Shift&#x7406;&#x8BBA;&#x7684;&#x53D1;&#x5C55;&#xFF0C;Mean Shift&#x7684;&#x542B;&#x4E49;&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BF4;Mean Shift&#x7B97;&#x6CD5;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x5373;&#x5148;&#x7B97;&#x51FA;&#x5F53;&#x524D;&#x70B9;&#x7684;&#x504F;&#x79FB;&#x5747;&#x503C;&#xFF0C;&#x79FB;&#x52A8;&#x8BE5;&#x70B9;&#x5230;&#x5176;&#x504F;&#x79FB;&#x5747;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x4EE5;&#x6B64;&#x4E3A;&#x65B0;&#x7684;&#x8D77;&#x59CB;&#x70B9;&#xFF0C;&#x7EE7;&#x7EED;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x6EE1;&#x8DB3;&#x4E00;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#x7ED3;&#x675F;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;Mean Shift&#x5E76;&#x6CA1;&#x6709;&#x5F15;&#x8D77;&#x4EBA;&#x4EEC;&#x7684;&#x6CE8;&#x610F;,&#x76F4;&#x5230;20&#x5E74;&#x4EE5;&#x540E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;1995&#x5E74;,&#x53E6;&#x5916;&#x4E00;&#x7BC7;&#x5173;&#x4E8E;Mean Shift&#x7684;&#x91CD;&#x8981;&#x6587;&#x732E;&#xFF08;Mean shift&#xFF0C;mode seeking, and clustering &#xFF09;&#x624D;&#x53D1;&#x8868;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x91CD;&#x8981;&#x7684;&#x6587;&#x732E;&#x4E2D;&#xFF0C;Yizong Cheng&#x5BF9;&#x57FA;&#x672C;&#x7684;Mean Shift&#x7B97;&#x6CD5;&#x5728;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x505A;&#x4E86;&#x63A8;&#x5E7F;,&#x9996;&#x5148;Yizong Cheng&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x65CF;&#x6838;&#x51FD;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x968F;&#x7740;&#x6837;&#x672C;&#x4E0E;&#x88AB;&#x504F;&#x79FB;&#x70B9;&#x7684;&#x8DDD;&#x79BB;&#x4E0D;&#x540C;,&#x5176;&#x504F;&#x79FB;&#x91CF;&#x5BF9;&#x5747;&#x503C;&#x504F;&#x79FB;&#x5411;&#x91CF;&#x7684;&#x8D21;&#x732E;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x5176;&#x6B21;Yizong Cheng&#x8FD8;&#x8BBE;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x7CFB;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x6837;&#x672C;&#x70B9;&#x91CD;&#x8981;&#x6027;&#x4E0D;&#x4E00;&#x6837;,&#x8FD9;&#x5927;&#x5927;&#x6269;&#x5927;&#x4E86;Mean Shift&#x7684;&#x9002;&#x7528;&#x8303;&#x56F4;&#x3002;&#x53E6;&#x5916;Yizong Cheng&#x6307;&#x51FA;&#x4E86;Mean Shift&#x53EF;&#x80FD;&#x5E94;&#x7528;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5E76;&#x7ED9;&#x51FA;&#x4E86;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>Mean Shift&#x7B97;&#x6CD5;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x6700;&#x4F18;&#x5316;&#x7406;&#x8BBA;&#x4E2D;&#x7684;&#x6700;&#x901F;&#x4E0B;&#x964D;&#x6CD5;&#xFF08;&#x4EA6;&#x79F0;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x725B;&#x987F;&#x6CD5;&#x7B49;&#xFF09;&#xFF0C;&#x5373;&#x6CBF;&#x7740;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65B9;&#x6CD5;&#x5BFB;&#x627E;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x7684;&#x6781;&#x503C;&#x3002;&#x5728;&#x8DDF;&#x8E2A;&#x4E2D;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5BFB;&#x627E;&#x5230;&#x76F8;&#x4F3C;&#x5EA6;&#x503C;&#x6700;&#x5927;&#x7684;&#x5019;&#x9009;&#x76EE;&#x6807;&#x4F4D;&#x7F6E;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x7406;&#x89E3;&#x4E3A;&#x662F;&#x4E00;&#x79CD;&#x6838;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x5C06;&#x6BCF;&#x4E2A;&#x70B9;&#x79FB;&#x52A8;&#x5230;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x6781;&#x5927;&#x503C;&#x70B9;&#x5904;&#xFF0C;&#x5373;&#xFF0C;&#x5BC6;&#x5EA6;&#x68AF;&#x5EA6;&#x4E3A;0&#x7684;&#x70B9;&#xFF0C;&#x4E5F;&#x53EB;&#x505A;&#x6A21;&#x5F0F;&#x70B9;&#x3002;</p>
<h2 id="&#x542B;&#x4E49;"><a href="#&#x542B;&#x4E49;" class="headerlink" title="&#x542B;&#x4E49;"></a>&#x542B;&#x4E49;</h2><p>&#x8F93;&#x5165;&#x662F;&#x4E00;&#x4E2A;5&#x7EF4;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;2&#x7EF4;&#x7684;&#xFF08;x&#xFF0C;y&#xFF09;&#x5730;&#x7406;&#x5750;&#x6807;&#xFF0C;3&#x7EF4;&#x7684;&#xFF08;L&#xFF0C;u&#xFF0C;v&#xFF09;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x5750;&#x6807;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x6539;&#x5199;&#x6210;rgb&#x8272;&#x5F69;&#x7A7A;&#x95F4;&#x6216;&#x8005;&#x662F;&#x7EB9;&#x7406;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5BF9;&#x5B83;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#xFF1A;</p>
<p>&#x628A;&#x8BE5;&#x5143;&#x7D20;&#x79FB;&#x52A8;&#x5230;&#x5B83;&#x90BB;&#x57DF;&#x4E2D;&#x6240;&#x6709;&#x5143;&#x7D20;&#x7684;&#x7279;&#x5F81;&#x503C;&#x7684;&#x5747;&#x503C;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x76F4;&#x5230;&#x6536;&#x655B;&#x3002;</p>
<p>&#x51C6;&#x786E;&#x7684;&#x8BF4;&#xFF0C;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x8BE5;&#x5143;&#x7D20;&#x4E0E;&#x5B83;&#x7684;&#x6536;&#x655B;&#x4F4D;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#x6807;&#x8BB0;&#x4E3A;&#x540C;&#x4E00;&#x7C7B;&#x3002;&#x5BF9;&#x4E8E;&#x56FE;&#x50CF;&#x6765;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x5143;&#x7D20;&#x7A0B;&#x77E9;&#x9635;&#x6392;&#x5217;&#xFF0C;&#x7279;&#x5F81;&#x503C;&#x4FBF;&#x662F;&#x50CF;&#x7D20;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x3002;</p>
<p><img src="/2016/10/09/mean-shift/shift intro.jpg" alt=""></p>
<p>&#x77E9;&#x5F62;&#x7A97;&#x53E3;&#x4E2D;&#x7684;&#x7EA2;&#x8272;&#x70B9;&#x4EE3;&#x8868;&#x6307;&#x7279;&#x5F81;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x77E9;&#x5F62;&#x4E2D;&#x7684;&#x5706;&#x5708;&#x4EE3;&#x8868;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x3002;</p>
<p>&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;Mean Shift&#x7B97;&#x6CD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x627E;&#x5230;&#x542B;&#x6709;&#x6700;&#x591A;&#x7279;&#x5F81;&#x7684;&#x7A97;&#x53E3;&#x533A;&#x57DF;&#xFF0C;&#x5373;&#x4F7F;&#x5706;&#x5FC3;&#x4E0E;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x6781;&#x503C;&#x70B9;&#x91CD;&#x5408;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F7F;&#x7A97;&#x53E3;&#x7684;&#x5706;&#x5FC3;&#x4E0E;&#x7279;&#x5F81;&#x6570;&#x636E;&#x70B9;&#x6700;&#x5BC6;&#x96C6;&#x7684;&#x5730;&#x65B9;&#x4E2D;&#x5FC3;&#x5C3D;&#x91CF;&#x91CD;&#x5408;&#x5230;&#x4E00;&#x5757;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x662F;&#x901A;&#x8FC7;&#x6CBF;&#x7740;&#x7279;&#x5F81;&#x70B9;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x4E0A;&#x5347;&#x68AF;&#x5EA6;&#x65B9;&#x5411;&#x9010;&#x6B65;&#x8FED;&#x4EE3;&#xFF0C;&#x76F4;&#x5230;&#x4E0A;&#x5347;&#x81F3;&#x68AF;&#x5EA6;&#x503C;&#x8FD1;&#x4F3C;&#x4E3A;&#x96F6;&#x7684;&#x5730;&#x65B9;&#xFF08;&#x5230;&#x8FBE;&#x6700;&#x5BC6;&#x96C6;&#x5904;&#xFF09;&#x3002;</p>
<p>&#x4ECE;&#x4E0A;&#x6587;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x8BA1;&#x7B97;&#x7A97;&#x53E3;&#x7684;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#xFF0C;&#x662F;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x504F;&#x79FB;&#x5411;&#x91CF;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x9009;&#x53D6;&#x521D;&#x59CB;&#x7A97;&#x53E3;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x5176;&#x9010;&#x6E10;&#x79FB;&#x52A8;&#x81F3;&#x76EE;&#x6807;&#x533A;&#x57DF;&#x5904;&#xFF0C;&#x5F53;&#x504F;&#x79FB;&#x5411;&#x91CF;&#x7684;&#x6A21;&#x4E3A;&#x96F6;&#x65F6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x81F3;&#x5DF2;&#x7ECF;&#x6536;&#x655B;&#xFF0C;&#x5C31;&#x505C;&#x6B62;&#x79FB;&#x52A8;&#xFF0C;&#x83B7;&#x5F97;&#x4E86;&#x76EE;&#x6807;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x4E0A;&#x5347;&#x68AF;&#x5EA6;&#x5462;&#xFF1F;</p>
<p>&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5927;&#x5C0F;&#x4E0D;&#x53D8;&#x7684;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x4E2D;&#x7279;&#x5F81;&#x70B9;&#x7684;&#x5BC6;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x627E;&#x7684;&#x662F;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x6700;&#x5927;&#x7684;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x4F7F;&#x4E0B;&#x4E00;&#x4E2A;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x503C; &#x51CF;&#x53BB; &#x5F53;&#x524D;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x503C;&#x5927;&#x4E8E;0&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8D8A;&#x6765;&#x8D8A;&#x9760;&#x8FD1;&#x53D6;&#x7A97;&#x53E3;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x5F53;&#x4E0B;&#x4E00;&#x4E2A;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x4E0E;&#x5F53;&#x524D;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x68AF;&#x5EA6;&#x8868;&#x793A;&#x4E24;&#x7A97;&#x53E3;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x5BF9;&#x5E94;&#x503C;&#x7684;&#x5DEE;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EA;&#x8981;&#x4F7F;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x5411;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x68AF;&#x5EA6;&#x4E0A;&#x5347;&#x7684;&#x65B9;&#x5411;&#x504F;&#x79FB;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x5347;&#x68AF;&#x5EA6;&#x503C;&#x8FD1;&#x4F3C;&#x4E3A;&#x96F6;&#x65F6;&#x53D6;&#x5F97;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x8FD1;&#x4F3C;&#x6700;&#x5927;&#x503C;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x6982;&#x7387;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x7279;&#x5F81;&#x6570;&#x636E;&#x70B9;&#x672C;&#x8EAB;&#x662F;&#x6982;&#x7387;&#x4E8B;&#x4EF6;&#x6216;&#x8005;&#x662F;&#x6807;&#x5B9A;&#x4E0E;&#x6807;&#x51C6;&#x7279;&#x5F81;&#x5339;&#x914D;&#x7A0B;&#x5EA6;&#x7684;&#x7279;&#x5F81;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x53D9;&#x8FF0;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5728;&#x9ED8;&#x8BA4;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x4E2D;&#x7684;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x6570;&#x636E;&#x70B9;&#x7684;&#x6743;&#x503C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E2D;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x6570;&#x636E;&#x70B9;&#x5BF9;&#x6700;&#x7EC8;&#x5224;&#x5B9A;&#x662F;&#x5426;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#x5F71;&#x54CD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x6743;&#x503C;&#x51FD;&#x6570;&#xFF08;&#x5373;meanshift&#x6269;&#x5C55;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x6838;&#x51FD;&#x6570;&#xFF09;&#x4EE5;&#x4FBF;&#x5F71;&#x54CD;&#x5224;&#x5B9A;&#x679C;&#x3002; </p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x7684;&#x6743;&#x503C;&#x51FD;&#x6570;&#x5E94;&#x6EE1;&#x8DB3;&#x4EC0;&#x4E48;&#x6761;&#x4EF6;&#x5462;&#xFF1F;</p>
<p>&#x5BF9;&#x67D0;&#x4E00;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x503C;=&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x6570;&#x636E;&#x70B9;&#x7684;&#x603B;&#x548C;&#x76F8;&#x5F53;&#x91CF; &#x9664;&#x4EE5; &#x7A97;&#x53E3;&#x9762;&#x79EF;&#x7684;&#x76F8;&#x5F53;&#x91CF;&#x3002;</p>
<p>&#x5F53;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x4E3A;&#x5168;&#x5C40;&#x7A97;&#x53E3;&#x65F6;&#xFF0C;&#x76EE;&#x6807;&#x4E00;&#x5B9A;&#x51FA;&#x73B0;&#xFF0C;&#x5373;&#x6B64;&#x8303;&#x56F4;&#x5185;&#x6743;&#x503C;&#x51FD;&#x6570;&#x7684;&#x5404;&#x4E2A;&#x503C;&#x7684;&#x603B;&#x548C;&#x5F52;&#x4E00;&#x5316;&#x540E;&#x4E00;&#x5B9A;&#x4E3A;1&#x3002;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x6BD4;&#x8F83;&#x548C;&#x6C42;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x6743;&#x503C;&#x51FD;&#x6570;&#x4EA6;&#x5373;&#x6838;&#x51FD;&#x6570;&#x5728;&#x81EA;&#x53D8;&#x91CF;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5185;&#x7684;&#x79EF;&#x5206;&#x4E3A;1&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6838;&#x51FD;&#x6570;&#x5E94;&#x6EE1;&#x8DB3;&#x7684;&#x6761;&#x4EF6;&#xFF1A;&#x81EA;&#x53D8;&#x91CF;&#x8303;&#x56F4;&#x5185;&#x79EF;&#x5206;&#xFF0C;&#x503C;&#x4E3A;1&#x3002;</p>
<h2 id="&#x7EC6;&#x8282;"><a href="#&#x7EC6;&#x8282;" class="headerlink" title="&#x7EC6;&#x8282;"></a>&#x7EC6;&#x8282;</h2><h3 id="&#x6838;&#x51FD;&#x6570;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;"><a href="#&#x6838;&#x51FD;&#x6570;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;" class="headerlink" title="&#x6838;&#x51FD;&#x6570;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;"></a>&#x6838;&#x51FD;&#x6570;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;</h3><p>&#x7ED9;&#x5B9A;D&#x7EF4;&#x7A7A;&#x95F4;Rd&#x4E2D;&#x7684;&#x6837;&#x672C;&#x96C6;&#x5408;{x}, i=1,2&#x2026;n&#xFF0C;&#x5219;&#x70B9;x&#x5173;&#x4E8E;&#x6838;&#x51FD;&#x6570;K(x)&#x548C;&#x5E26;&#x5BBD;&#x77E9;&#x9635;H&#x7684;&#x6838;&#x51FD;&#x6570;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x8868;&#x793A;&#x4E3A;&#xFF1A;<br><img src="/2016/10/09/mean-shift/equation1.png" alt=""><br>&#x5176;&#x4E2D;<br><img src="/2016/10/09/mean-shift/equation2.png" alt=""><br>&#x5176;&#x4E2D;H&#x8868;&#x793A;D&#xD7;D&#x5E26;&#x5BBD;&#x77E9;&#x9635;&#x3002;&#x6211;&#x4EEC;&#x7528;&#x6BD4;&#x4F8B;&#x5355;&#x4F4D;&#x77E9;&#x9635;h&#xB2;l&#x6765;&#x8868;&#x793A;H&#xFF0C;&#x5C06;&#x4E0A;&#x9762;&#x7684;&#x6838;&#x5BC6;&#x5EA6;&#x65B9;&#x7A0B;&#x5199;&#x6210;&#x4E0B;&#x9762;&#x7684;&#x5178;&#x578B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;<br><img src="/2016/10/09/mean-shift/equation3.png" alt=""><br>&#x7531;&#x4E8E;<br><img src="/2016/10/09/mean-shift/equation4.png" alt=""><br>&#xFF0C;&#x53EF;&#x5C06;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x5199;&#x6210;&#x5173;&#x4E8E;&#x6838;&#x51FD;&#x6570;&#x7684;&#x8F6E;&#x5ED3;&#x51FD;&#x6570;&#x5F62;&#x5F0F;&#xFF1A;<br><img src="/2016/10/09/mean-shift/equation5.png" alt=""><br>&#x7531;&#x4E0A;&#x9762;&#x7684;&#x5F0F;&#x5B50;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6838;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x6743;&#x503C;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x662F;&#x5C06;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x6309;&#x5230;&#x4E2D;&#x5FC3;x&#x70B9;&#x8DDD;&#x79BB;&#x7684;&#x8FDC;&#x8FD1;&#x8FDB;&#x884C;&#x52A0;&#x6743;&#xFF0C;&#x8DDD;&#x79BB;&#x4E2D;&#x5FC3;&#x70B9;&#x8FD1;&#x7684;&#x6837;&#x672C;&#x70B9;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x5F71;&#x54CD;&#x5927;&#xFF0C;&#x8D4B;&#x4E88;&#x5927;&#x7684;&#x6743;&#x503C;&#xFF0C;&#x53CD;&#x4E4B;&#xFF0C;&#x8D4B;&#x4E88;&#x5C0F;&#x7684;&#x6743;&#x503C;&#x3002;</p>
<h3 id="mean-shift-&#x5411;&#x91CF;"><a href="#mean-shift-&#x5411;&#x91CF;" class="headerlink" title="mean shift &#x5411;&#x91CF;"></a>mean shift &#x5411;&#x91CF;</h3><p>&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x5DF2;&#x7ECF;&#x7531;&#x6838;&#x51FD;&#x6570;&#x6765;&#x4F30;&#x8BA1;&#x51FA;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x96C6;&#x5408;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x65B9;&#x7A0B;&#xFF0C;&#x6765;&#x5206;&#x6790;&#x6570;&#x636E;&#x96C6;&#x5408;&#x4E2D;&#x5BC6;&#x5EA6;&#x6700;&#x5927;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#x4F4D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x6C42;&#x5BFC;&#xFF0C;&#x5206;&#x6790;&#x68AF;&#x5EA6;&#x53D8;&#x5316;&#x3002;<br><img src="/2016/10/09/mean-shift/equation6.png" alt=""><br>&#x7B2C;&#x4E8C;&#x4E2A;&#x4E2D;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;Mean Shift&#x5411;&#x91CF;&#xFF0C;&#x8868;&#x793A;&#x4E3A;m(x):<br><img src="/2016/10/09/mean-shift/equation7.png" alt=""><br>&#x4E3A;&#x4E86;&#x66F4;&#x76F4;&#x89C2;&#x7684;&#x8BF4;&#x660E;&#x4E0A;&#x9762;&#x516C;&#x5F0F;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6838;&#x51FD;&#x6570;g(x)=1&#xFF0C;&#x8FD9;&#x6837;&#x4E0A;&#x9762;&#x7684;&#x5F0F;&#x5B50;&#x5C31;&#x53EF;&#x4EE5;&#x5199;&#x4E3A;&#xFF1A;<br><img src="/2016/10/09/mean-shift/simplify core shift.jpg" alt=""><br>&#x4E2D;&#x95F4;&#x7684;&#x5B9E;&#x5FC3;&#x9ED1;&#x70B9;&#x8868;&#x793A;x&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x6838;&#x51FD;&#x6570;&#x7684;&#x4E2D;&#x5FC3;&#x3002;&#x5468;&#x56F4;&#x7684;&#x7A7A;&#x5FC3;&#x767D;&#x70B9;&#x662F;&#x6837;&#x672C;&#x70B9;&#x3002;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x6837;&#x672C;&#x70B9;&#x76F8;&#x5BF9;&#x4E8E;&#x6838;&#x51FD;&#x6570;&#x4E2D;&#x5FC3;&#x70B9;&#x7684;&#x504F;&#x79FB;&#x5411;&#x91CF;&#xFF0C;&#x5E73;&#x5747;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x4F1A;&#x6307;&#x5411;&#x6837;&#x672C;&#x70B9;&#x6700;&#x5BC6;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x68AF;&#x5EA6;&#x65B9;&#x5411;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Mean Shift&#x5411;&#x91CF;&#x5E94;&#x8BE5;&#x8F6C;&#x79FB;&#x5230;&#x6837;&#x672C;&#x70B9;&#x76F8;&#x5BF9;&#x70B9;&#x53D8;&#x5316;&#x6700;&#x591A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5176;&#x65B9;&#x5411;&#x4E5F;&#x5C31;&#x662F;&#x5BC6;&#x5EA6;&#x68AF;&#x5EA6;&#x7684;&#x65B9;&#x5411;&#x3002;<br>&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x4E2D;&#x6240;&#x6709;&#x6837;&#x672C;&#x70B9;xi&#x5BF9;m(x)&#x7684;&#x8D21;&#x732E;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x79BB;x&#x8D8A;&#x8FD1;&#x7684;&#x91C7;&#x6837;&#x70B9;&#x5BF9;&#x4F30;&#x8BA1;x&#x5468;&#x56F4;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x6027;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x5F15;&#x5165;&#x6838;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5F0F;&#x4E2D;<br><img src="/2016/10/09/mean-shift/equation8.png" alt=""><br>&#x5C31;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;&#x91C7;&#x6837;&#x70B9;&#x7684;&#x6743;&#x503C;&#x3002;<br><img src="/2016/10/09/mean-shift/simplify core shift result.png" alt=""></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/算法/" rel="tag">#算法</a>
          
            <a href="/tags/聚类/" rel="tag">#聚类</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/30/hello-world/" rel="next" title="如何发布文章">
                <i class="fa fa-chevron-left"></i> 如何发布文章
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="Andrew" />
          <p class="site-author-name" itemprop="name">Andrew</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">2</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">1</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">2</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#简介"><span class="nav-number">1.</span> <span class="nav-text">简介</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#含义"><span class="nav-number">2.</span> <span class="nav-text">含义</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#细节"><span class="nav-number">3.</span> <span class="nav-text">细节</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#核函数密度估计"><span class="nav-number">3.1.</span> <span class="nav-text">核函数密度估计</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#mean-shift-向量"><span class="nav-number">3.2.</span> <span class="nav-text">mean shift 向量</span></a></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <!--<i class="fa fa-heart"></i>-->
  </span>
  <span class="author" itemprop="copyrightHolder">Andrew</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
